{
  "courses": [
    {
      "title": "nodejs with  students",
      "trainer": "shashi",
      "description": "Node.js® is an open-source, cross-platform JavaScript runtime environment.",
      "id": 1
    },
    {
      "title": "python",
      "trainer": "dixith",
      "description": "Python is a high-level, general-purpose programming language. Its design philosophy emphasizes code readability with the use of significant indentation. Python is dynamically typed and garbage-collected. It supports multiple programming paradigms, including structured, object-oriented and functional programming",
      "createdAt": "2023-11-23",
      "id": 3
    },
    {
      "title": "xxxx",
      "trainer": "shashi",
      "description": "A call stack is a way for the JavaScript engine to keep track of its place in code that calls multiple functions. It has the information on what function is currently being run and what functions are invoked from within that function…",
      "id": 4
    },
    {
      "title": "dotnet",
      "trainer": "girish",
      "description": "The .NET platform is a free and open-source, managed computer software framework for Windows, Linux, and macOS operating systems. The project is mainly developed by Microsoft employees by way of the .NET Foundation and is released under an MIT License",
      "createdAt": "2023-11-22",
      "id": 5
    },
    {
      "title": "springboot",
      "trainer": "manoj",
      "description": "Spring Runtime offers support and binaries for OpenJDK™, Spring, and Apache Tomcat® in one simple subscription. Learn more. Upcoming events.",
      "createdAt": "2023-11-22",
      "id": 6
    },
    {
      "title": "react router",
      "trainer": "shashi",
      "description": "react router dom is very imaportant in react app",
      "createdAt": "2023-11-24",
      "id": 7
    },
    {
      "title": "selenium",
      "trainer": "taranath",
      "description": "selenium is ui testing framework",
      "createdAt": "2023-11-24",
      "id": 8
    }
  ]
}